app/controllers/categories_controller.rb

  def index
    categories = Category.all.sort
    @categories_voted = categories.reject { |c| current_user.voted? c }.shuffle
    @categories_not_voted = categories.select { |c| current_user.voted? c }
---
SELECT "categories".* FROM "categories"
SELECT  "votes".* FROM "votes"  WHERE "votes"."user_id" = 1 AND "votes"."category_id" IS NULL LIMIT 1