app/controllers/nominees_controller.rb

  def create
    category = Category.find(params[:category_id])
    Nominee.create!(resource_params.first) unless category.is_closed_to_nominate
---
SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "nominees" ("category_id", "user_id") VALUES ($1, $2) RETURNING "id"  [["category_id", 2], ["user_id", 34]]
SELECT  "nominees".* FROM "nominees"   ORDER BY "nominees"."id" DESC LIMIT 1