app/controllers/votes_controller.rb

SELECT  "categories".* FROM "categories"  WHERE "categories"."id" = $1 LIMIT 1  [["id", 1]]
SELECT  "votes".* FROM "votes"  WHERE "votes"."user_id" = 1 AND "votes"."category_id" IS NULL LIMIT 1
INSERT INTO "votes" ("category_id", "nominee_id", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["category_id", 1], ["nominee_id", 1], ["user_id", 1]]
---
  def create
    return redirect_to :back if current_user.voted?(Category.find(resource_params.first[:category_id]))
    @vote = Vote.create!(resource_params.first)