app/views/categories/show.html.slim

- if current_user.voted?(@category)
  p = "Ya votaste a #{current_user.find_vote(@category).nominee.user.name} capo"
---
SELECT  "votes".* FROM "votes"  WHERE "votes"."user_id" = 1 AND "votes"."category_id" IS NULL LIMIT 1
SELECT "nominees".* FROM "nominees"  WHERE "nominees"."category_id" = $1  [["category_id", 1]]
SELECT "users".* FROM "users"  WHERE ("users"."id" NOT IN (2, 42, 8, 1))  ORDER BY "users"."name" DESC